app/controllers/simple_searches_controller.rb

SELECT  "simple_searches".* FROM "simple_searches" WHERE "simple_searches"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_simple_search
      @simple_search = SimpleSearch.find(params[:id])